stephenshizl/tanker-flow-mcu/Libraries/Device/Geehy/APM32F0xx/Include/apm32f072xx.h
    /* Interrupt & status register */
    union
    {
        __IM  uint32_t STS;

        struct
        {
            __IM  uint32_t PEFLG      : 1;
            __IM  uint32_t FEFLG      : 1;
            __IM  uint32_t NEFLG      : 1;
            __IM  uint32_t OVREFLG    : 1;
            __IM  uint32_t IDLEFLG    : 1;
            __IM  uint32_t RXBNEFLG   : 1;
            __IM  uint32_t TXCFLG     : 1;
            __IM  uint32_t TXBEFLG    : 1;
            __IM  uint32_t LBDFLG     : 1;
            __IM  uint32_t CTSFLG     : 1;
            __IM  uint32_t CTSCFG     : 1;
            __IM  uint32_t RXTOFLG    : 1;
            __IM  uint32_t EOBFLG     : 1;
            __IM  uint32_t RESERVED1  : 1;
            __IM  uint32_t ABRDEFLG   : 1;
            __IM  uint32_t ABRDFLG    : 1;
            __IM  uint32_t BSYFLG     : 1;
            __IM  uint32_t CMFLG      : 1;
            __IM  uint32_t TXBFFLG    : 1;
            __IM  uint32_t RXWFMUTE   : 1;
            __IM  uint32_t WSMFLG     : 1;
            __IM  uint32_t TXENACKFLG : 1;
            __IM  uint32_t RXENACKFLG : 1;
            __IM  uint32_t RESERVED2  : 9;
        } STS_B;
    } ;

    /* Interrupt flag clear register */
    union
    {
        __IOM uint32_t INTFCLR;

        struct
        {
            __IOM uint32_t PECLR      : 1;
            __IOM uint32_t FECLR      : 1;
            __IOM uint32_t NECLR      : 1;
            __IOM uint32_t OVRECLR    : 1;
            __IOM uint32_t IDLECLR    : 1;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t TXCCLR     : 1;
            __IM  uint32_t RESERVED2  : 1;
            __IOM uint32_t LBDCLR     : 1;
            __IOM uint32_t CTSCLR     : 1;
            __IM  uint32_t RESERVED3  : 1;
            __IOM uint32_t RXTOCLR    : 1;
            __IOM uint32_t EOBCLR     : 1;
            __IM  uint32_t RESERVED4  : 4;
            __IOM uint32_t CMCLR      : 1;
            __IM  uint32_t RESERVED5  : 2;
            __IOM uint32_t WSMCLR     : 1;
            __IM  uint32_t RESERVED6  : 11;
        } INTFCLR_B;
    } ;

    /* Receive data register */
    union
    {
        __IM  uint32_t RXDATA;

        struct
        {
            __IM  uint32_t RXDATA     : 9;
            __IM  uint32_t RESERVED1  : 23;
        } RXDATA_B;
    } ;

    /* Transmit data register */
    union
    {
        __IOM uint32_t TXDATA;

        struct
        {
            __IOM uint32_t TXDATA     : 9;
            __IM  uint32_t RESERVED1  : 23;
        } TXDATA_B;
    } ;
} USART_T;

/**
  * @brief Window watchdog (WWDT)
  */

typedef struct
{
    union
    {
        /* Control register */
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t CNT        : 7;
            __IOM uint32_t WWDTEN     : 1;
            __IM  uint32_t RESERVED1  : 24;
        } CTRL_B;
    } ;

    union
    {
        /* Configuration register */
        __IOM uint32_t CFG;

        struct
        {
            __IOM uint32_t WIN        : 7;
            __IOM uint32_t TBPSC      : 2;
            __IOM uint32_t EWIEN      : 1;
            __IM  uint32_t RESERVED1  : 22;
        } CFG_B;
    } ;

    union
    {
        /* Status register  */
        __IOM uint32_t STS;

        struct
        {
            __IOM uint32_t EWIFLG     : 1;
            __IM  uint32_t RESERVED1  : 31;
        } STS_B;
    } ;
} WWDT_T;

/**
 * @brief   Universal Serial Bus Device (USB)
 */

typedef union
{
    __IOM uint32_t EP;

    struct
    {
        __IOM uint32_t ADDR           : 4;
        __IOM uint32_t TXSTS          : 2;
        __IOM uint32_t TXDTOG         : 1;
        __IOM uint32_t CTFT           : 1;
        __IOM uint32_t KIND           : 1;
        __IOM uint32_t TYPE           : 2;
        __IOM uint32_t SETUP          : 1;
        __IOM uint32_t RXSTS          : 2;
        __IOM uint32_t RXDTOG         : 1;
        __IOM uint32_t CTFR           : 1;
        __IM  uint32_t RESERVED       : 16;
    } EP_B;
} USB_EP_REG_T;

typedef struct
{
    /* Endpoint */
    USB_EP_REG_T EP[8];

    __IOM uint32_t RESERVED1[8];

    /**
     * @brief   Control register
     */
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IOM uint32_t FORRST     : 1;
            __IOM uint32_t PWRDOWN    : 1;
            __IOM uint32_t LPWREN     : 1;
            __IOM uint32_t FORSUS     : 1;
            __IOM uint32_t WKUPREQ    : 1;
            __IOM uint32_t L1WKUPREQ  : 1;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t L1STSREQIM : 1;
            __IOM uint32_t ESOFIEN    : 1;
            __IOM uint32_t SOFIEN     : 1;
            __IOM uint32_t RSTIEN     : 1;
            __IOM uint32_t SUSIEN     : 1;
            __IOM uint32_t WKUPIEN    : 1;
            __IOM uint32_t ERRIEN     : 1;
            __IOM uint32_t PMAOUIEN   : 1;
            __IOM uint32_t CTRIEN     : 1;
            __IM  uint32_t RESERVED2  : 16;
        } CTRL_B;
    };

    /**
     * @brief   Interrupt status register
     */
    union
    {
        __IOM uint32_t INTSTS;

        struct
        {
            __IOM uint32_t EPID       : 4;
            __IOM uint32_t DOT        : 1;
            __IM  uint32_t RESERVED1  : 2;
            __IOM uint32_t L1STSREQ   : 1;
            __IOM uint32_t ESOFFLG    : 1;
            __IOM uint32_t SOFFLG     : 1;
            __IOM uint32_t RSTREQ     : 1;
            __IOM uint32_t SUSREQ     : 1;
            __IOM uint32_t WUPREQ     : 1;
            __IOM uint32_t ERRFLG     : 1;
            __IOM uint32_t PMOFLG     : 1;
            __IOM uint32_t CTFLG      : 1;
            __IM  uint32_t RESERVED2  : 16;
        } INTSTS_B;
    };

    /**
     * @brief   Frame number register
     */
    union
    {
        __IOM uint32_t FRANUM;

        struct
        {
            __IOM uint32_t FRANUM     : 11;
            __IOM uint32_t LSOFNUM    : 2;
            __IOM uint32_t LOCK       : 1;
            __IOM uint32_t RXDMSTS    : 1;
            __IOM uint32_t RXDPSTS    : 1;
            __IM  uint32_t RESERVED   : 16;
        } FRANUM_B;
    };

    /**
     * @brief   Device address register
     */
    union
    {
        __IOM uint32_t ADDR;

        struct
        {
            __IOM uint32_t ADDR       : 7;
            __IOM uint32_t USBDEN     : 1;
            __IM  uint32_t RESERVED   : 24;
        } ADDR_B;
    };

    /**
     * @brief   Buffer table address register
     */
    union
    {
        __IOM uint32_t BUFFTB;

        struct
        {
            __IM  uint32_t RESERVED1  : 3;
            __IOM uint32_t BUFFTB     : 13;
            __IM  uint32_t RESERVED2  : 16;
        } BUFFTB_B;
    };

    /**
     * @brief   LPM control and status regiter
     */
    union
    {
        __IOM uint32_t LPMCTRLSTS;

        struct
        {
            __IOM uint32_t LPMEN      : 1;
            __IOM uint32_t LPMACKEN   : 1;
            __IM  uint32_t RESERVED1  : 1;
            __IOM uint32_t REMWAKE    : 1;
            __IOM uint32_t BESL       : 4;
            __IM  uint32_t RESERVED2  : 24;
        } LPMCTRLSTS_B;
    };

    /**
     * @brief   Battery charging detector regiter
     */
    union
    {
        __IOM uint32_t BCD;

        struct
        {
            __IOM uint32_t BCDEN      : 1;
            __IOM uint32_t DCDEN      : 1;
            __IOM uint32_t PDEN       : 1;
            __IOM uint32_t SDEN       : 1;
            __IOM uint32_t DCDFLG     : 1;
            __IOM uint32_t PDFLG      : 1;
            __IOM uint32_t SDFLG      : 1;
            __IOM uint32_t DMPUDFLG   : 1;
            __IM  uint32_t RESERVED1  : 7;
            __IOM uint32_t DPPUCTRL   : 1;
            __IM  uint32_t RESERVED2  : 16;
        } BCD_B;
    };
} USBD_T;

/**@} end of group Peripheral_registers_structures*/

/** @defgroup Peripheral_memory_map
  @{
*/

/*@} end of group Device_Register*/

